
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекстСообщения(ТекстСообщения)
	
//создание защищённого соединения с сервером "api.telegram.org"	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL());
	
//добавление заголовока "Content-Type" со значением "application/json"	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	
//создание HTTP-запрос к ресурсу /bot[ВашТокен]/sendMessage	
	Запрос = Новый HTTPЗапрос(("/bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() +"/sendMessage"), Заголовки);
	
//Структура с полями:
//"chat_id" - идентификатор группы из константы,
//"text" - текст сообщения
	НовыеДанные = новый структура;
	НовыеДанные.Вставить("chat_id",Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
	НовыеДанные.Вставить("text", ТекстСообщения);
	
//установите JSON строку, полученную из структуры, в качестве тела HTTP-запроса	
	СтрокаJSON = ЗаписатьЗначениеJSON(НовыеДанные);
	
//отправьте запрос с помощью метода "POST"	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
//Использую "ОтправитьДляОбработки", так как не получается вызвать "ОтправитьДляОбработкиАсинх" - ругается на возврат типа "Promise"	
	//@skip-check bsl-legacy-check-dynamic-feature-access
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
//проверьте, что получет ответ с кодом состояния 200, если код состояния отличный от 200, 
	Если НЕ Ответ.КодСостояния = 200 Тогда
		//получите тело ответа как строку и запишите в журнал регистрации информацию об ошибке.	
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации("Ошибка получения сообщения из Телеграмм бота", "Ошибка", СтрШаблон("Ошибка, код состояния %1, тело ответа %2", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку),,Истина);		
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции


Процедура ВКМ_ОтправкаУведомленийТелеграмм() Экспорт
	Выборка = Справочники.ВКМ_УведомленияТелеграммБоту.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		УспешноОтправлено = ПолучитьТекстСообщения(Выборка.ВКМ_ТекстСообщения);
		Если УспешноОтправлено Тогда
			ОбъектСправочника = Выборка.ПолучитьОбъект();
			ОбъектСправочника.Удалить();
		КонецЕсли;		
	КонецЦикла;	
	
КонецПроцедуры
#КонецОбласти
	