#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ДополнительныеНачисления
	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудников из ВКМ_СписокСотрудников Цикл
		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПремияФиксированная;
		Движение.ПериодРегистрации = Дата;
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудников.ВКМ_Сотрудник;
		Движение.ВКМ_Сумма = ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии;
	КонецЦикла;
	
	
	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудников из ВКМ_СписокСотрудников Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудников.ВКМ_Сотрудник;
		НДФЛ = Окр(ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии * 0.13, 2);
		Движение.ВКМ_Сумма = НДФЛ;
	КонецЦикла;

	// регистр ВКМ_ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудников из ВКМ_СписокСотрудников Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудников.ВКМ_Сотрудник;
		НДФЛ = Окр(ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии * 0.13, 2);
		Движение.ВКМ_Сумма = ТекСтрокаВКМ_СписокСотрудников.ВКМ_СуммаПремии - НДФЛ;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
		//Данный фрагмент построен конструктором.
		//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ВКМ_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли