#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НачалоДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаНачалаДоговора");
	КонецДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_ДатаОкончанияДоговора");
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание	Тогда
		Если НЕ НачалоДоговора < Дата И Дата <= КонецДоговора Тогда
		 	ОбщегоНазначения.СообщитьПользователю("Срок выбранного договра истек!"); 
			Отказ = Истина;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Выбран договор с некорректным видом договора!"); 
		Отказ = Истина;
	КонецЕсли;
	
	//Отправка сообщения ТГ
	ТекстСообщения = "";
	Если НЕ ЭтоНовый() Тогда
		
		ПредыдущиеРекизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Специалист, ДатаПроведенияРабот, ВремяНачалаРабот, ВремяОкончанияРабот");
		
		НовыйРеквизит = Новый Структура;
		НовыйРеквизит.Вставить("Специалист", Специалист);
		НовыйРеквизит.Вставить("ДатаПроведенияРабот", ДатаПроведенияРабот);
		НовыйРеквизит.Вставить("ВремяНачалаРабот", ВремяНачалаРабот);
		НовыйРеквизит.Вставить("ВремяОкончанияРабот", ВремяОкончанияРабот);
		
		Если НЕ ОбщегоНазначения.ДанныеСовпадают(ПредыдущиеРекизиты, НовыйРеквизит) Тогда
			ТекстСообщения = СтрШаблон("Внесены изменения по заявке №%1. Просьба специалисту %2 обратить внимание. Дата проведения работ: %3, время начала работ: %4, время окончания работ: %5.", Номер, Специалист, ДатаПроведенияРабот, Формат(ВремяНачалаРабот, "ДФ=hh:mm:ss"), Формат(ВремяОкончанияРабот, "ДФ=hh:mm:ss"));
		КонецЕсли;	
	Иначе
		ТекстСообщения = СтрШаблон("На специалиста %1 заведена новая заявка!", Специалист);		
	КонецЕсли;
	
	Если ТекстСообщения<>"" Тогда
		СправочникУведомленияТелеграммБоту = Справочники.ВКМ_УведомленияТелеграммБоту;
		НовоеУведомление = СправочникУведомленияТелеграммБоту.СоздатьЭлемент();	
		НовоеУведомление.ТекстСообщения = ТекстСообщения;
		НовоеУведомление.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Ставка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СтоимостьЧасаРаботы");
	ЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	ЧасовКОплатеФакт = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	
	Отбор = Новый Структура("Сотрудник", Специалист);
	ПроцентОтРабот = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(Дата, Отбор).Получить(0).ПроцентОтРабот;
	Если Не ЗначениеЗаполнено(ПроцентОтРабот) Тогда
		ТекстСообщения = СтрШаблон("По сотруднику %1 не заполнен параметр ""процент от работ""",Специалист);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Отказ = Истина;
	ИначеЕсли ПроцентОтРабот = 0 Тогда 
		СуммаКОплатеВСР = ЧасовКОплатеКлиенту * Ставка / 100;
	Иначе
		СуммаКОплатеВСР = ЧасовКОплатеКлиенту * Ставка * ПроцентОтРабот / 100;
	КонецЕсли;
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Для Каждого ТекСтрока из ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = ТекСтрока.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = ТекСтрока.ЧасыКОплатеКлиенту * Ставка;
	КонецЦикла;
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ЧасовКОплатеФакт;
	Движение.СуммаКОплате =  СуммаКОплатеВСР;
	//по формуле из задания СуммаКОплате = ЧасовКОплатеКлиенту * СтавкаЧасаКлиента * ПроцентОтРабот / 100

Конецпроцедуры

#КонецОбласти

#КонецЕсли