#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НачалоДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_ДатаНачалаДоговора");
	КонецДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_ДатаОкончанияДоговора");
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание	Тогда
		Если НЕ НачалоДоговора < Дата И Дата <= КонецДоговора Тогда
		 	ОбщегоНазначения.СообщитьПользователю("Срок выбранного договра истек!"); 
			Отказ = Истина;
		КонецЕсли;
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Выбран договор с некорректным видом договора!"); 
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Ставка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВКМ_Договор, "ВКМ_СтоимостьЧасаРаботы");
	ЧасовКОплатеКлиенту = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ЧасыКОплатеКлиенту");
	ЧасовКОплатеФакт = ВКМ_ВыполненныеРаботы.Итог("ВКМ_ФактическиПотраченоЧасов");
	
	Отбор = Новый Структура("ВКМ_Сотрудник", ВКМ_Специалист);
	ПроцентОтРабот = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(Дата, Отбор).Получить(0).ВКМ_ПроцентОтРабот;
	Если Не ЗначениеЗаполнено(ПроцентОтРабот) Тогда
		ТекстСообщения = СтрШаблон("По сотруднику %1 не заполнен параметр ""процент от работ""",ВКМ_Специалист);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения); 
		Отказ = Истина;
	ИначеЕсли ПроцентОтРабот = 0 Тогда 
		СуммаКОплатеВСР = ЧасовКОплатеКлиенту * Ставка / 100;
	Иначе
		СуммаКОплатеВСР = ЧасовКОплатеКлиенту * Ставка * ПроцентОтРабот / 100;
	КонецЕсли;
	
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Для Каждого ТекСтрока из ВКМ_ВыполненныеРаботы Цикл
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Клиент = ВКМ_Клиент;
		Движение.ВКМ_Договор = ВКМ_Договор;
		Движение.ВКМ_КоличествоЧасов = ТекСтрока.ВКМ_ЧасыКОплатеКлиенту;
		Движение.ВКМ_СуммаКОплате = ТекСтрока.ВКМ_ЧасыКОплатеКлиенту * Ставка;
	КонецЦикла;
	
	// регистр ВКМ_ВыполненныеСотрудникомРаботы
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Специалист;
	Движение.ВКМ_ЧасовКОплате = ЧасовКОплатеФакт;
	Движение.ВКМ_СуммаКОплате =  СуммаКОплатеВСР;
	//по формуле из задания СуммаКОплате = ЧасовКОплатеКлиенту * СтавкаЧасаКлиента * ПроцентОтРабот / 100

Конецпроцедуры

Процедура ПриЗаписи(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	ИсторияДанных.ОбновитьИсторию();
	УстановитьПривилегированныйРежим(Ложь);
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = "";
	Если НЕ ЭтоНовый() Тогда
		ОтборВерсий = Новый Структура;
		ОтборВерсий.Вставить("Данные", ссылка);
		
		Версии = ИсторияДанных.ВыбратьВерсии(ОтборВерсий, , , 1);
		Если Версии.Количество() > 0 Тогда
			НомерПрошлойВерсии = Версии.Получить(0).НомерВерсии;
			ПрошлаяВерсия = ИсторияДанных.СформироватьПоВерсии(Ссылка, НомерПрошлойВерсии);
			ПрошлаяДата = ПрошлаяВерсия.Дата;
			ПрошлыйСпециалист = ПрошлаяВерсия.ВКМ_Специалист;
		КонецЕсли;
			
		Если ПрошлаяДата <> Дата Тогда
			ТекстСообщения = СтрШаблон("Дата/время документа №%1 было изменено на %2.", Номер, Дата);
		КонецЕсли;
		
		Если ПрошлыйСпециалист <> ВКМ_Специалист Тогда
			ТекстСообщения = ТекстСообщения + СтрШаблон("Был изменен специалист с %1 на %2 в документе №%3.",ПрошлыйСпециалист, ВКМ_Специалист, Номер);
		КонецЕсли;
	Иначе
		ТекстСообщения = СтрШаблон("На специалиста %1 заведена новая заявка!", ВКМ_Специалист);		
	КонецЕсли;
	
	Если ТекстСообщения<>"" Тогда
		СправочникУведомленияТелеграммБоту = Справочники.ВКМ_УведомленияТелеграммБоту;
		НовоеУведомление = СправочникУведомленияТелеграммБоту.СоздатьЭлемент();	
		НовоеУведомление.ВКМ_ТекстСообщения = ТекстСообщения;
		НовоеУведомление.Записать();
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#КонецЕсли