#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
		
	// регистр ВКМ_ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудниковОсновное из ВКМ_СписокСотрудниковОсновное Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_Сотрудник;
		Движение.ВКМ_Сумма = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_Начислено - ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_НДФЛ;
	КонецЦикла;

	// регистр ВКМ_Отпуска
	Движения.ВКМ_Отпуска.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудниковОсновное из ВКМ_СписокСотрудниковОсновное Цикл
		Если ЗначениеЗаполнено(ТекСтрокаВКМ_СписокСотрудниковОсновное.ДниФактСкрытое) Тогда
			Движение = Движения.ВКМ_Отпуска.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_Сотрудник;
			Движение.ВКМ_ДниФакт = ТекСтрокаВКМ_СписокСотрудниковОсновное.ДниФактСкрытое;
			Движение.ВКМ_ДниПлан = 0;
		КонецЕсли;
	КонецЦикла;

	// регистр ВКМ_ОсновныеНачисления
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудниковОсновное из ВКМ_СписокСотрудниковОсновное Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = НачалоМесяца(Дата);
		Движение.ПериодДействияКонец = КонецМесяца(Дата);
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_Сотрудник;
		Движение.ВКМ_Сумма = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_Начислено;
	КонецЦикла;

	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_СписокСотрудниковОсновное из ВКМ_СписокСотрудниковОсновное Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.ВКМ_Сотрудник = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_Сотрудник;
		Движение.ВКМ_Сумма = ТекСтрокаВКМ_СписокСотрудниковОсновное.ВКМ_НДФЛ;
	КонецЦикла;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ВКМ_Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли