#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Если СписокСотрудниковОсновное.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю("Таблица начислений пуста! Заполните таблицу.");
		Отказ = Истина;
	КонецЕсли;
	
	НачисленияРасчетПроцентыОкладОтпуск();
	ДвиженияПоОтпускам();
	ДвиженияНДФЛ();	
	ДвиженияВзаиморасчетов();
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область  СлужебныеПроцедурыИФункции

Процедура НачисленияРасчетПроцентыОкладОтпуск()
	
	// регистр ВКМ_ОсновныеНачисления
	Для каждого СтрокаСотрудник из СписокСотрудниковОсновное Цикл
		
		Если СтрокаСотрудник.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентЗаВыполненныеРаботы Тогда
			//делаем движения по процентам за выполненные работы
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = СтрокаСотрудник.ВидРасчета;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = СтрокаСотрудник.ДатаНачала;
			Движение.ПериодДействияКонец = СтрокаСотрудник.ДатаОкончания;
			Движение.Сотрудник = СтрокаСотрудник.Сотрудник;
			Движение.Сумма = СтрокаСотрудник.Начислено;
		Иначе	
			// Преддвижение по отпускам и окладам
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
			Движение.Сторно = Ложь;
			Движение.ВидРасчета = СтрокаСотрудник.ВидРасчета;
			Движение.ПериодРегистрации = Дата;
			Движение.ПериодДействияНачало = СтрокаСотрудник.ДатаНачала;
			Движение.ПериодДействияКонец = СтрокаСотрудник.ДатаОкончания;
			Движение.Сотрудник = СтрокаСотрудник.Сотрудник;
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	РасчетОкладов();
	РасчетОтпусков();

КонецПроцедуры

Функция ПолучитьОкладыСотрудников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотр.Ссылка КАК Сотрудник,
	|	ЕСТЬNULL(УслОП.Оклад, 0) КАК Оклад
	|ИЗ
	|	Справочник.Пользователи КАК Сотр
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Условия.Сотрудник КАК Сотрудник,
	|			Условия.Оклад КАК Оклад
	|		ИЗ
	|			РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&ДатаРасчета, ) КАК Условия) КАК УслОП
	|		ПО (Сотр.Ссылка = УслОП.Сотрудник)
	|ГДЕ
	|	Сотр.ПометкаУдаления = ЛОЖЬ
	|	И Сотр.Служебный = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ДатаРасчета", Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	ОкладыСотрудников = Новый Соответствие;	
	
	Пока Выборка.Следующий() Цикл
		ОкладыСотрудников.Вставить(Выборка.Сотрудник, Выборка.Оклад);
	КонецЦикла;
	
	Возврат ОкладыСотрудников;
	
КонецФункции

Процедура РасчетОкладов()
	
	// Получить оклады сотрудников. 	
	ОкладыСотрудников = ПолучитьОкладыСотрудников();	
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия КАК РабочийДеньНорма,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия КАК РабочийДеньФактический
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|ГДЕ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Регистратор = &Регистратор
	|	И ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ОплатаПоОкладу);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Оклад = ОкладыСотрудников.Получить(Выборка.Сотрудник);	
		Движение.Сумма = ?(Выборка.РабочийДеньНорма = 0, 0, Оклад * Выборка.РабочийДеньФактический / Выборка.РабочийДеньНорма);	  		   
	КонецЦикла;  

	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
	
Конецпроцедуры

Процедура РасчетОтпусков()
	
	// Получить средний заработок сотрудников за последний год, если такой инфы нет, то за сколько есть выплаты, если и такой инфы нет, то установлю мин. 2000
	СреднийЗаработок = ПолучитьСреднийЗаработок();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньПериодДействия КАК РабочийДеньНормаВсего,
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.РабочийДеньФактическийПериодДействия КАК РабочийДеньФактическийВСоставеОтпуска
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика КАК ВКМ_ОсновныеНачисленияДанныеГрафика
	|ГДЕ
	|	ВКМ_ОсновныеНачисленияДанныеГрафика.Регистратор = &Регистратор
	|	И ВКМ_ОсновныеНачисленияДанныеГрафика.ВидРасчета = &ВидРасчета";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		Заработок = СреднийЗаработок.Получить(Выборка.Сотрудник);	
		Движение.Сумма = Заработок * Выборка.РабочийДеньФактическийВСоставеОтпуска;	  		   
	КонецЦикла;  

	Движения.ВКМ_ОсновныеНачисления.Записать(,Истина);
	
Конецпроцедуры

Функция ПолучитьСреднийЗаработок()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	Сотр.Ссылка КАК Сотрудник,
	|	ЕСТЬNULL(СУММА(Начисления.СуммаНачислений), 0) / ЕСТЬNULL(СУММА(РабочиеДни.РабочиеДниМесяца), 1) КАК
	|		СреднедневнойЗаработок
	|ИЗ
	|	Справочник.Пользователи КАК Сотр
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Взаиморасчеты.Сотрудник КАК Сотрудник,
	|			ГОД(Взаиморасчеты.Период) КАК Год,
	|			МЕСЯЦ(Взаиморасчеты.Период) КАК Месяц,
	|			СУММА(Взаиморасчеты.Сумма) КАК СуммаНачислений
	|		ИЗ
	|			РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками КАК Взаиморасчеты
	|		ГДЕ
	|			Взаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			И Взаиморасчеты.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаРасчета, МЕСЯЦ, -12) И &ДатаРасчета
	|		СГРУППИРОВАТЬ ПО
	|			Взаиморасчеты.Сотрудник,
	|			ГОД(Взаиморасчеты.Период),
	|			МЕСЯЦ(Взаиморасчеты.Период)) КАК Начисления
	|		ПО Сотр.Ссылка = Начисления.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ГОД(Данные.ДатаГрафика) КАК Год,
	|			МЕСЯЦ(Данные.ДатаГрафика) КАК Месяц,
	|			КОЛИЧЕСТВО(Данные.ДатаГрафика) КАК РабочиеДниМесяца
	|		ИЗ
	|			РегистрСведений.ВКМ_ДанныеГрафика КАК Данные
	|		ГДЕ
	|			Данные.РабочийДень = 1
	|		СГРУППИРОВАТЬ ПО
	|			ГОД(Данные.ДатаГрафика),
	|			МЕСЯЦ(Данные.ДатаГрафика)) КАК РабочиеДни
	|		ПО РабочиеДни.Год = Начисления.Год
	|		И РабочиеДни.Месяц = Начисления.Месяц
	|ГДЕ
	|	Сотр.ПометкаУдаления = ЛОЖЬ
	|	И Сотр.Служебный = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	Сотр.Ссылка";
	
	Запрос.УстановитьПараметр("ДатаРасчета", Дата);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СреднийЗаработок = Новый Соответствие;	
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.СреднедневнойЗаработок = 0 Тогда
			Заработок = 2000;
		Иначе
			Заработок = Выборка.СреднедневнойЗаработок;
		КонецЕсли;
		СреднийЗаработок.Вставить(Выборка.Сотрудник, Заработок);
	КонецЦикла;

	Возврат СреднийЗаработок;
	
КонецФункции

Процедура ДвиженияПоОтпускам()
	
	// регистр ВКМ_Отпуска	
	Для каждого СтрокаСотрудник из СписокСотрудниковОсновное Цикл		
		Если СтрокаСотрудник.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение = Движения.ВКМ_Отпуска.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сотрудник = СтрокаСотрудник.Сотрудник; 
			КоличествоДнейФакт = (СтрокаСотрудник.ДатаОкончания - СтрокаСотрудник.ДатаНачала)/86400  + 1; 
			Движение.ДниФакт = КоличествоДнейФакт;
			Движение.ДниПлан = 0;
		КонецЕсли;
	КонецЦикла;
	
		Движения.ВКМ_Отпуска.Записать();
		
КонецПроцедуры

Процедура ДвиженияНДФЛ()
	
	// регистр ВКМ_Удержания
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.Регистратор КАК Регистратор,
	|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
	|	ВКМ_ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ВКМ_ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисления.Сумма КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Сотрудник = Выборка.Сотрудник;
		НДФЛ = Окр(Выборка.Сумма * 0.13, 2); 
		Движение.Сумма = НДФЛ;
	КонецЦикла;
	 
		Движения.ВКМ_Удержания.Записать();
		
КонецПроцедуры

Процедура ДвиженияВзаиморасчетов()
	
	// регистр ВКМ_ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
	|	ВКМ_ОсновныеНачисления.ВидРасчета КАК ВидРасчета,
	|	ВКМ_ОсновныеНачисления.ПериодДействия КАК ПериодДействия,
	|	ВКМ_ОсновныеНачисления.ПериодДействияНачало КАК ПериодДействияНачало,
	|	ВКМ_ОсновныеНачисления.ПериодДействияКонец КАК ПериодДействияКонец,
	|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
	|	ВКМ_ОсновныеНачисления.Сумма КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
	|ГДЕ
	|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма - Окр(Выборка.Сумма * 0.13, 2);   
	КонецЦикла;  

КонецПроцедуры

#КонецОбласти   

#КонецЕсли