#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)
	РазностьДат();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)
	РазностьДат();
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковПриИзменении(Элемент)
	РазностьДат();
	//Проверить сумму дней
	СоответсвиеСтрудникаИДней = Новый Соответствие();
	
	Для Каждого Строка из Объект.ОтпускаСотрудников Цикл
		Сотрудник = Строка.Сотрудник;
		ЧислоДней = Строка.РазностьДат;
		Если СоответсвиеСтрудникаИДней.Получить(Сотрудник) = Неопределено Тогда
			СоответсвиеСтрудникаИДней.Вставить(Сотрудник, ЧислоДней);	
		Иначе
			СоответсвиеСтрудникаИДней[Сотрудник] = СоответсвиеСтрудникаИДней[Сотрудник] + ЧислоДней;
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого Элемент Из СоответсвиеСтрудникаИДней Цикл
		
		Для Каждого Строка из Объект.ОтпускаСотрудников Цикл
			
			Если Элемент.Значение > 28 Тогда
				Если Строка.Сотрудник = Элемент.Ключ Тогда
					Строка.УчестьБольшойОтпуск = Истина;		
				КонецЕсли;	
			Иначе
				Если Строка.Сотрудник = Элемент.Ключ Тогда
					Строка.УчестьБольшойОтпуск = Ложь;		
				КонецЕсли;	
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ПараметрыДляАнализа = АнализГрафикаНаСервере();
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыДляАнализа, Объект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РазностьДат()
	
	СтрокаТабличнойЧасти = Элементы.ОтпускаСотрудников.ТекущиеДанные;
	Если СтрокаТабличнойЧасти.ДатаОкончания < СтрокаТабличнойЧасти.ДатаНачала Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Дата окончания меньше даты начала отпуска");	
		Возврат;
	КонецЕсли;
	СтрокаТабличнойЧасти.РазностьДат = ((НачалоДня(СтрокаТабличнойЧасти.ВКМ_ДатаОкончания) - НачалоДня(СтрокаТабличнойЧасти.ВКМ_ДатаНачала)) / (60 * 60 * 24)) + 1;

КонецПроцедуры

&НаСервере
Функция АнализГрафикаНаСервере()
	
    ДанныеДляПередачи = Новый Структура;
    ДанныеДляПередачи.Вставить("Год", Объект.Год);
    ДанныеДляПередачи.Вставить("Отпуска", Объект.ОтпускаСотрудников.Выгрузить());
	
    АдресХранилища = ПоместитьВоВременноеХранилище(ДанныеДляПередачи, Объект);
	
    ПараметрыДляАнализа = Новый Структура("АдресХранилища", АдресХранилища);
	
    Возврат ПараметрыДляАнализа;
    
КонецФункции

#КонецОбласти