
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Данные = ПолучитьИзВременногоХранилища(Параметры.АдресХранилища);
	Год = Данные.Год;
	ТабОтпуска = Данные.Отпуска;
	ТабОтпуска.Сортировать("ВКМ_Сотрудник");
	Период.ДатаНачала = НачалоГода(Год) ;
	Период.ДатаОкончания = КонецГода(Год);
	
	ПостроитьДиаграммуГанта(ТабОтпуска, Год);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПостроитьДиаграммуГанта(ТабОтпуска, Год)
	
	ДиаграммаГанта.Обновление = Ложь;
    ДиаграммаГанта.Очистить();
		
	СерияОтпуск = ДиаграммаГанта.Серии.Добавить();
	СерияОтпуск.Текст = "Отпуска";	
	
    Для Каждого Стр Из ТабОтпуска Цикл    	
    	ТочкаСотрудник = ДиаграммаГанта.Точки.Добавить();	
    	ТочкаСотрудник.Текст = Стр.ВКМ_Сотрудник;
    	
    	ЗначениеСотрудник = ДиаграммаГанта.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
    	
		ИнтервалСотрудник = ЗначениеСотрудник.Добавить();
		ИнтервалСотрудник.Начало = Стр.ВКМ_ДатаНачала;
		ИнтервалСотрудник.Конец = Стр.ВКМ_ДатаОкончания;		
    КонецЦикла;
    
	ДиаграммаГанта.Обновление = Истина;

КонецПроцедуры

#КонецОбласти
