#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
    
    Объект.СписокСотрудниковОсновное.Очистить();
	
	ЗаполнитьИнформациюПоСотрудникам();
	

	Объект.СписокСотрудниковОсновное.Сортировать("Сотрудник Возр");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере 
Процедура ЗаполнитьИнформациюПоСотрудникам()
	
	ДатаНачала = НачалоМесяца(Объект.Дата);
	ДатаОкончания = КонецМесяца(Объект.Дата);
	
	//1. Заполняем всех сотрудников для начисления оклада
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	Пользователи.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.Пользователи КАК Пользователи
	|ГДЕ
	|	Пользователи.Служебный = ЛОЖЬ
	|	И Пользователи.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьПоОкладу = Объект.СписокСотрудниковОсновное.Добавить();
		ЗаписьПоОкладу.Сотрудник = Выборка.Сотрудник;	
		ЗаписьПоОкладу.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ОплатаПоОкладу;	
		ЗаписьПоОкладу.ДатаНачала = ДатаНачала;	
		ЗаписьПоОкладу.ДатаОкончания = ДатаОкончания;
	КонецЦикла;
	
	// 2. Заполняем отпуска по согласно графика отпуска, которые попадают полностью или частично в период
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|    Отпуска.Сотрудник КАК Сотрудник,
	|
	|    // Дата начала отпуска внутри периода
	|    ВЫБОР
	|        КОГДА Отпуска.ДатаНачала > &ДатаНачала
	|            ТОГДА Отпуска.ДатаНачала
	|        ИНАЧЕ &ДатаНачала
	|    КОНЕЦ КАК ДатаНачалаОтпускаВПериоде,
	|
	|    // Дата окончания отпуска внутри периода
	|    ВЫБОР
	|        КОГДА Отпуска.ДатаОкончания < &ДатаОкончания
	|            ТОГДА Отпуска.ДатаОкончания
	|        ИНАЧЕ &ДатаОкончания
	|    КОНЕЦ КАК ДатаОкончанияОтпускаВПериоде,
	|
	|    // Количество дней
	|    РАЗНОСТЬДАТ(
	|        ВЫБОР
	|            КОГДА Отпуска.ДатаНачала > &ДатаНачала
	|                ТОГДА Отпуска.ДатаНачала
	|            ИНАЧЕ &ДатаНачала
	|        КОНЕЦ,
	|        ДОБАВИТЬКДАТЕ(
	|            ВЫБОР
	|                КОГДА Отпуска.ДатаОкончания < &ДатаОкончания
	|                    ТОГДА Отпуска.ДатаОкончания
	|                ИНАЧЕ &ДатаОкончания
	|            КОНЕЦ,
	|            ДЕНЬ,
	|            1
	|        ),
	|        ДЕНЬ
	|    ) КАК ДниОтпускаВПериоде
	|
	|ИЗ
	|    Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК Отпуска
	|
	|ГДЕ
	|    ГОД(Отпуска.Ссылка.Год) = ГОД(&ДатаРасчета)
	|    И Отпуска.ДатаНачала <= &ДатаОкончания
	|    И Отпуска.ДатаОкончания >= &ДатаНачала
	|
	|СГРУППИРОВАТЬ ПО
	|    Отпуска.Сотрудник,
	|    Отпуска.ДатаНачала,
	|    Отпуска.ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаРасчета", Объект.Дата);
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьПоОтпуску = Объект.СписокСотрудниковОсновное.Добавить();
		ЗаписьПоОтпуску.Сотрудник = Выборка.Сотрудник;	
		ЗаписьПоОтпуску.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск;	
		ЗаписьПоОтпуску.ДатаНачала = Выборка.ДатаНачалаОтпускаВПериоде;	
		ЗаписьПоОтпуску.ДатаОкончания = Выборка.ДатаОкончанияОтпускаВПериоде;
	КонецЦикла;
	
	// 3. Заполнить информацию по процентам
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|    Сотр.Ссылка КАК Сотрудник,
	|    ЕСТЬNULL(ВыпРаб.СуммаКОплате, 0) КАК СуммаЗаВыполненыеРаботыПроцентом
	|ИЗ
	|    Справочник.Пользователи КАК Сотр
	|        ЛЕВОЕ СОЕДИНЕНИЕ (
	|            ВЫБРАТЬ
	|                Выполненные.Сотрудник КАК Сотрудник,
	|                СУММА(Выполненные.СуммаКОплатеОборот) КАК СуммаКОплате
	|            ИЗ
	|                РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ПериодНачала, &ПериодОкончания,,) КАК Выполненные
	|            СГРУППИРОВАТЬ ПО
	|                Выполненные.Сотрудник
	|        ) КАК ВыпРаб
	|        ПО Сотр.Ссылка = ВыпРаб.Сотрудник
	|ГДЕ
	|    Сотр.ПометкаУдаления = ЛОЖЬ
	|    И Сотр.Служебный = ЛОЖЬ
	|    И ЕСТЬNULL(ВыпРаб.СуммаКОплате, 0) <> 0";
	
	Запрос.УстановитьПараметр("ПериодНачала", ДатаНачала);
	Запрос.УстановитьПараметр("ПериодОкончания", ДатаОкончания);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ЗаписьПоПроценту = Объект.СписокСотрудниковОсновное.Добавить();
		ЗаписьПоПроценту.Сотрудник = Выборка.Сотрудник;	
		ЗаписьПоПроценту.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентЗаВыполненныеРаботы;	
		ЗаписьПоПроценту.ДатаНачала = ДатаНачала;	
		ЗаписьПоПроценту.ДатаОкончания = ДатаОкончания;
		ЗаписьПоПроценту.Начислено = Выборка.СуммаЗаВыполненыеРаботыПроцентом;
	КонецЦикла;
	
КонецПроцедуры
	
#КонецОбласти


