
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	Курсор = Период.ДатаНачала;
	Пока Курсор < Период.ДатаОкончания Цикл
		Запись = РегистрыСведений.ВКМ_ДанныеГрафика.СоздатьМенеджерЗаписи();
		Запись.ВКМ_Дата = Курсор;
		Если ДеньНедели(Курсор) <=5 Тогда
			Запись.ВКМ_РабочийДень = 1;
		КонецЕсли;
		Запись.Записать(); 
		Курсор = Курсор + 86400;
	КонецЦикла;
КонецПроцедуры
#КонецОбласти