#Область ОбработчикиСобытийСервера
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВКМ_ПроверкаВидаДоговора();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВКМ_ПроверкаВидаДоговора();
КонецПроцедуры

Процедура ВКМ_ПроверкаВидаДоговора()
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание") Тогда		
		Элементы.ВКМ_ДанныеПоДоговору.Видимость = Истина;
	Иначе
		Элементы.ВКМ_ДанныеПоДоговору.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры	
#КонецОбласти

