#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	   
	Объект.ВКМ_Выплаты.Очистить();

    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_Сотрудник КАК Сотрудник,
	|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВКМ_СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&НаДату, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";

    Запрос.УстановитьПараметр("НаДату", КонецДня(Объект.Дата));

    Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		НоваяСтрока = Объект.ВКМ_Выплаты.Добавить();
        НоваяСтрока.ВКМ_Сотрудник = Результат.Сотрудник;
        НоваяСтрока.ВКМ_Сумма = Результат.СуммаОстаток;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

